Autodesk.Revit.DB.ExternalResourceReference.CreateFromCloudPath(Autodesk.Revit.DB.ModelPath)
Creates an ExternalResourceReference from a cloud path.
path:
A cloud path.
Returns:
The newly-created reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given path path is not a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The model is not allowed to access.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Since:
2022

Autodesk.Revit.DB.ExternalResourceReference.IsValidReference(Autodesk.Revit.DB.ExternalResourceType)
Checks whether the reference is in a valid format.
Remarks:
This function checks:
The server id corresponds to a valid server which
implements IExternalResourceServer.The server supports the given ExternalResourceType.The reference information is well-formed.
This function does not check whether the resource exists
on the server.
resourceType:
The type of resource which the ExternalResourceReference should
correspond to.
Returns:
True if this is a valid ExternalResourceReference. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.CreateLocalResource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.PathType)
Creates an ExternalResourceReference representing a local file managed
by Revit's built-in server.
doc:
The document containing the reference. If the PathType is relative,
the path will be made relative to the location of this Document. (If
this Document belongs to a workshared model,
the reference will be relative to the central model.)
resourceType:
The type of the external resource.
path:
A path to the external file. This path must be absolute. If the PathType is
relative, then Revit will relativize the path according to the location
of the given Document.
pathType:
An enum indicating the type of path which the ExternalResourceReference should use.
The PathType must be PathType.Server if the reference is to a Revit model on
Revit Server. The PathType must be PathType.Absolute if the reference is local
but the host model or host's central model are on Revit Server.
Returns:
The newly-created ExternalResourceReference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The PathType.Enum value is not valid for this resource type or Document location.
PathType.Content is not valid for Revit links. The PathType must be PathType.Server
if the resource is on Revit Server and is only valid for Revit links. The PathType
must be PathType.Absolute if the host document or the host document's central model
are on Revit Server.
-or-
The given path path is a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The model is not allowed to access.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.InSessionPath
The path stores the full display path which includes the server name plus the path provided by ExternalResourceServer.
The path that Revit will present for user recognizing and browsing to this resource during one session of Revit.
This property allows ExternalResourceServers to handle cases where the path to a resource may vary between Revit sessions.
For example, if this ExternalResourceReference refers to a resource in a folder,
this property can be used to store the current path of the resource. If the resource is moved to another folder later,
the ExternalResourceServer could calculate the correct path for the resource from resource identification information
when it is loaded and store it in this property,
so that it will work correctly even if the rvt file is opened in a different location.
Do not rely on this path to look up an ExternalResourceReference, as the path is neither unique nor stable. It isn't unique
because multiple servers might use the same server name and display name format. It isn't stable because some servers allow renaming,
and because a server might change its name at some point.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
Creates a new ExternalResourceReference from the given ExternalResourceReference.
other:
The ExternalResourceReference to copy.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.#ctor(System.Guid,System.Collections.Generic.IDictionary{System.String,System.String},System.String,System.String)
Creates a new ExternalResourceReference from the given data.
serverId:
The id of the server associated with this
ExternalResourceReference. The server must implement
IExternalResourceServer.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
version:
The version of the external data.
inSessionPath:
The path that identifies a resource in server. ExternalResourceServer must provide this path which should not contain the server name.
Revit internally will construct and store the full display path which includes the server name plus this path at the time a resource
is loaded into the model for use if the server is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is not allowed to access.
Since:
2015